public/code/testing-a-web-service/request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:mys="MyService">
   <soapenv:Header/>
   <soapenv:Body>
      <mys:Hello>
         <name>Rafael</name>
      </mys:Hello>
   </soapenv:Body>
</soapenv:Envelope>
